## Быстрое погружение

Операторы цикла нужны, чтобы повторить какие-то действия несколько раз.

Напишем программу, которая десять раз печатает строчку текста "Hello World":

```c
#include <stdio.h>

int main(void)
{
    printf("Hello World!\n");
    printf("Hello World!\n");
    printf("Hello World!\n");
    printf("Hello World!\n");
    printf("Hello World!\n");
    printf("Hello World!\n");
    printf("Hello World!\n");
    printf("Hello World!\n");
    printf("Hello World!\n");
    printf("Hello World!\n");
    return 0;
}
```

Конечно, в любом текстовом редакторе довольно просто скопировать нужную строчку несколько раз. Но зачем делать "тупую" работу самим, если с именно такой работой прекрасно справляется компьютер?

С помощью цикла for эту программу можно переписать так:

```c
#include <stdio.h>

int main(void)
{
    for (int i = 0; i < 10; i++) {
        printf("Hello World!\n");
    }
    return 0;
}
```

Всего 4 строчки для организации печати того, что нам нужно, вместо 10!
И чтобы напечатать 100 раз надо поменять всего одно значение, а не добавлять еще 90 строк.

Более того: можно написать программу, не зная сколько именно раз она будет печатать фразу, предоставив пользователю выбирать нужное количество:

```c
#include <stdio.h>

int main(void)
{
    printf("How much? ");
    int n;
    scanf("%d", &n);
    for (int i = 0; i < n; ++i) {
        printf("Hello World!\n");
    }
    return 0;
}
```

Как организовать циклическое выполнение какого-то действия, чтобы оно выполнилось нужное нам количество раз? Очень просто: надо считать, который раз мы выполняем это действие. (Этот очередной раз выполнения называется итерацией цикла.) Переменная i и выполняют роль такого вот счетчика использованного здесь цикла.

Правда для использования цикла потребовалась специальная переменная `i`, чтобы следить за тем, который раз мы печатаем фразу, чтобы напечатать именно столько раз, сколько нужно.

Мы начинаем цикл со значением `i` равным 0, выполняем очередную итерацию цикла (т. е. очередной "виток" вычислений цикла), если `i` строго меньше `n`, и после каждой итерации увеличиваем `i` на единицу с помощью операции преинкремента (`++i`).

В результате цикл выполнится для всех значений `i` от `0` до `n - 1`, т. е. `n` раз.
Именно из-за этого слова "для" этот оператор цикла так и называется (`for`).

## Необходимые формальности

Синтаксис:

> for ( <u>выражение-1</u> ; <u>выражение-2</u> ; <u>выражение-3</u> ) <u>оператор</u>

Каждое из выражений-1-2-3 может отсутствовать (в том числе и все).

Семантика:

- <u>оператор</u> - это тело цикла - те действия, которые мы собираемся циклически повторять.
- <u>выражение-1</u> - это действия по инициализации тех переменных, которые используются в цикле, они выполняются до начала итераций цикла.
- <u>выражение-2</u> - это условие выполнения цикла, оно проверяется перед началом каждой итерации цикла, если условие истинно, выполняется очередная итерация, если ложно - выполнение оператора цикла заканчивается; если это выражение отсутствует, то считается, что используется тождественно истинное условие.
- <u>выражение-3</u> - это действия по изменению значений переменных для перехода к следующей итерации цикла, эти действия выполняются после каждого выполнения тела цикла.

Значения <u>выражение-1</u> и <u>выражение-3</u> не используются, используются только их побочные эффекты, поэтому бессмысленно писать в качестве этих выражений такие, которые никак не изменяют значений переменных.

## Пример
Вычисление факториала с помощью цикла

```c
#include <stdio.h>

int main(void) {
    printf("Enter an integer value: ");
    int n;
    scanf("%d", &n);

    int result = 1;
    for (int i = 1; i <= n; i++) {
        result = result * i;
    }
    printf("Factorial: %d\n", result);

    return 0;
}
```

А как усовершенствовать программу, чтобы она печатала сообщение об ошибке при вводе отрицательного значения?

## Вложенные циклы
См. [[Вложенные циклы]].
